# This file contains some examples for the students to try

## Handling Tables and Files

### Import the PANDAS module

In [2]:
import pandas as pd

### Use the Pandas module to read a text file into a dataframe

In [3]:
my_dataframe = pd.read_csv("grades.csv", sep = "\t")

In [4]:
my_dataframe.head()

,stdNo,stdName,BirthDate,email,Test 1,Test 2,Lab 1,Lab 2,Lab 3,Lab 4
0,701,Rosa C. Olsen,07/06/1996,l0701@aln.iseg.ulisboa.pt,16.8,9.2,12.6,10.6,13.7,9.2
1,798,Clarence Sheridan,03/01/1996,l0798@aln.iseg.ulisboa.pt,15.8,15.8,18.9,19.6,14.2,4.3
2,854,Jaclyn T. Glover,20/09/1995,l0854@aln.iseg.ulisboa.pt,11.2,8.5,9.1,16.8,13.0,19.6
3,663,Catherine U. Buggs,09/12/1995,l0663@aln.iseg.ulisboa.pt,15.0,6.8,5.4,8.2,6.2,4.4
4,921,James E. Watkins,08/08/1999,l0921@aln.iseg.ulisboa.pt,11.0,8.0,16.9,5.4,14.9,5.1

In [5]:
print(my_dataframe.loc[3][1])
print(my_dataframe.iloc[3,1])

Catherine U. Buggs
Catherine U. Buggs

In [6]:
my_dataframe.loc[3:6]['stdName']

3      Catherine U. Buggs
4        James E. Watkins
5          Babara T. Best
6    Carlton L. Dickerson
Name: stdName, dtype: object

In [7]:
my_dataframe.iloc[3:6 , 1:4]

              stdName   BirthDate                      email
3  Catherine U. Buggs  09/12/1995  l0663@aln.iseg.ulisboa.pt
4    James E. Watkins  08/08/1999  l0921@aln.iseg.ulisboa.pt
5      Babara T. Best  09/04/1998  l0890@aln.iseg.ulisboa.pt

In [8]:
my_dataframe.iat[2,4]

11.2

#### Add a column to a dataframe

In [9]:
my_dataframe['FinalGrade'] = 0.0

In [10]:
my_dataframe.head()

,stdNo,stdName,BirthDate,email,Test 1,Test 2,Lab 1,Lab 2,Lab 3,Lab 4,FinalGrade
0,701,Rosa C. Olsen,07/06/1996,l0701@aln.iseg.ulisboa.pt,16.8,9.2,12.6,10.6,13.7,9.2,0.0
1,798,Clarence Sheridan,03/01/1996,l0798@aln.iseg.ulisboa.pt,15.8,15.8,18.9,19.6,14.2,4.3,0.0
2,854,Jaclyn T. Glover,20/09/1995,l0854@aln.iseg.ulisboa.pt,11.2,8.5,9.1,16.8,13.0,19.6,0.0
3,663,Catherine U. Buggs,09/12/1995,l0663@aln.iseg.ulisboa.pt,15.0,6.8,5.4,8.2,6.2,4.4,0.0
4,921,James E. Watkins,08/08/1999,l0921@aln.iseg.ulisboa.pt,11.0,8.0,16.9,5.4,14.9,5.1,0.0


#### Go through all the rows and update the Final Grade

##### First calculate the length of the dataframe (i.e., the number of rows):

In [11]:
l = len(my_dataframe)
print(l)

16

##### In a cycle from row 0 to the last row (numbered l-1) update each value in the column FinalGrade (column number 10) calculate the final grade and update the cell

In [12]:
for i in range(0, l):
    my_dataframe.iat[i, 10] = round(sum(my_dataframe.loc[i][4:10]) / 6, 1)

In [13]:
my_dataframe.head()

,stdNo,stdName,BirthDate,email,Test 1,Test 2,Lab 1,Lab 2,Lab 3,Lab 4,FinalGrade
0,701,Rosa C. Olsen,07/06/1996,l0701@aln.iseg.ulisboa.pt,16.8,9.2,12.6,10.6,13.7,9.2,12.0
1,798,Clarence Sheridan,03/01/1996,l0798@aln.iseg.ulisboa.pt,15.8,15.8,18.9,19.6,14.2,4.3,14.8
2,854,Jaclyn T. Glover,20/09/1995,l0854@aln.iseg.ulisboa.pt,11.2,8.5,9.1,16.8,13.0,19.6,13.0
3,663,Catherine U. Buggs,09/12/1995,l0663@aln.iseg.ulisboa.pt,15.0,6.8,5.4,8.2,6.2,4.4,7.7
4,921,James E. Watkins,08/08/1999,l0921@aln.iseg.ulisboa.pt,11.0,8.0,16.9,5.4,14.9,5.1,10.2

### Write the Dataframe to a new Excel File

In [14]:
my_writer = pd.ExcelWriter('MyNewExcelFile.xlsx', engine = 'xlsxwriter')
my_dataframe.to_excel(my_writer, sheet_name = 'Grades', index = False)
my_writer.close()